config/ext/Documents/ТелефонныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ТелефонныйЗвонок</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АбонентКакСвязаться</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентКонтакт</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентПредставление</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_UUID</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_ВнутреннийНомер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РС_ИдентификаторПользователяАТС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/ext/Documents/ТелефонныйЗвонок/Forms/ФормаДокумента/Ext/Form/Module.bsl
//++ 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase
&НаКлиенте
Процедура РСК_ПриОткрытииПосле(Отказ)
	Если РС_СозданАвтоматически И ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		ТекущийНомер = Объект.АбонентКакСвязаться;
		КонтактПриИзменении(Неопределено);
		Объект.АбонентКакСвязаться = ТекущийНомер;
	КонецЕсли;
	ОбновитьОтборЗадач();
КонецПроцедуры
//-- 07.01.2021, Тарасов Михаил: подключение телефонии Дом.РУ к DevBase

&НаСервере
Процедура ОбновитьОтборЗадач()
	
	ОтборИнициатор = Неопределено;
	ОтборКлиент = Неопределено;
	Для Каждого ЭлементОтбора Из РС_СписокЗадач.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "ОтборИнициатор" Тогда
			ОтборИнициатор = ЭлементОтбора;
		ИначеЕсли ЭлементОтбора.Представление = "ОтборКлиент" Тогда
			ОтборКлиент = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборИнициатор = Неопределено ИЛИ ОтборКлиент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда
		ОтборИнициатор.ПравоеЗначение = Справочники.КонтактныеЛица.ПустаяСсылка();
		ОтборКлиент.ПравоеЗначение = Справочники.Контрагенты.ПустаяСсылка();
		ОтборИнициатор.Использование = Истина;
		ОтборКлиент.Использование = Истина;
	ИначеЕсли РС_ОтборСпискаЗадач = 0 Тогда
		ОтборИнициатор.ПравоеЗначение = Объект.АбонентКонтакт;
	    ОтборИнициатор.Использование = Истина;
		ОтборКлиент.Использование = Ложь;
	Иначе
		ОтборКлиент.ПравоеЗначение = Объект.АбонентКонтакт.Владелец;
	    ОтборКлиент.Использование = Истина;
		ОтборИнициатор.Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_АбонентКонтактПриИзмененииПосле(Элемент)
	
	ОбновитьОтборЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_РС_ОтборСпискаЗадачПриИзмененииПосле(Элемент)
	
	ОбновитьОтборЗадач();	
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_АбонентКонтактОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбновитьОтборЗадач();
	
КонецПроцедуры

&НаКлиенте
&После("ОбработкаОповещения")
Процедура РСК_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбранКонтакт" Тогда
		ОбновитьОтборЗадач();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РСК_ПрикрепитьКЗадачеПосле(Команда)
	
	Если Элементы.РС_СписокЗадач.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВзаимодействиеОснование = Элементы.РС_СписокЗадач.ТекущиеДанные.Ссылка;
	Предмет = Объект.ВзаимодействиеОснование;
	Модифицированность = Истина;
	
КонецПроцедуры
